---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroLanguageType
source: html/7481402e-debc-27d2-0c96-fa6108aca851.htm
---
# Autodesk.Revit.DB.Macros.MacroLanguageType

The Macro language types.

## Syntax (C#)
```csharp
public enum MacroLanguageType
```